In [3]:
import pandas as pd

In [5]:
df = pd.read_csv('atlantis_citizens_final.csv')
df.head()

,Citizen_ID,Diet_Type,District_Name,Occupation,Wealth_Index,House_Size_sq_ft,Life_Expectancy,Vehicle_Owned,Work_District,Bio_Hash
0,CIT_15935,Exotic Imports,Coral Slums,Scribe,1491.0,100.0,42.0,Fin Bicycle,Mariana Plaza,b81cb8ce
1,CIT_11623,Seafood,Coral Slums,Fisher,1596.0,100.0,49.0,Sea Scooter,Deep Trench,72f48eef
2,CIT_8026,Seafood,Mariana Plaza,Warrior,3921.0,533.0,37.0,Sea Scooter,Deep Trench,0abde296
3,CIT_0492,Exotic Imports,Deep Trench,Fisher,NaN,136.0,38.0,Fin Bicycle,Deep Trench,8055fc9e
4,CIT_0275,Seaweed,Deep Trench,Warrior,25985.0,2673.0,54.0,Sea Scooter,Deep Trench,c77829e2

In [6]:
df.describe()
# to get information about our data

        Wealth_Index  House_Size_sq_ft  Life_Expectancy
count   14696.000000      14554.000000     15137.000000
mean     9529.708628       1417.153772        51.913391
std     20502.182375       2233.194323        16.567063
min      1000.000000        100.000000        20.000000
25%      1978.000000        205.000000        40.000000
50%      3794.500000        477.000000        49.000000
75%      8951.500000       1470.750000        60.000000
max    589377.000000      10000.000000       110.000000

In [7]:
# Distribution of target variable (Occupation)
df['Occupation'].value_counts()

Occupation
Merchant    3535
Warrior     3531
Fisher      3136
Miner       3028
Scribe      2521
Name: count, dtype: int64

In [ ]:
df["Bio_Hash"].duplicated().sum()
# to see if there are multiple people having same occupation

In [ ]:
df["Occupation"].value_counts()
# frequency of occupations

In [ ]:
df["District_Name"].value_counts()
# frequency of district

In [9]:
df.groupby("District_Name")["Wealth_Index"].median()
# to see the distribution of money across the districts

District_Name
Coral Slums         3371.414207
Deep Trench         4806.795825
Mariana Plaza       8535.553804
The Golden Reef    18726.909656
Name: Wealth_Index, dtype: float64

In [8]:
df.groupby("District_Name")["Life_Expectancy"].describe()
# to see how the district is related with life expectancy

                  count       mean        std   min   25%   50%   75%    max
District_Name
Coral Slums      3030.0  44.307591   8.897222  20.0  38.0  44.0  50.0   83.0
Deep Trench      4505.0  43.758047  10.453507  20.0  36.0  42.0  50.0   94.0
Mariana Plaza    2996.0  51.851469  13.242605  20.0  42.0  51.0  60.0  110.0
The Golden Reef  4606.0  64.933565  18.879662  20.0  51.0  62.0  75.0  110.0

In [10]:
df.groupby(["District_Name", "Occupation"])["Occupation"].count()
# to see the distribution of occupation across the districts

District_Name    Occupation
Coral Slums      Fisher         925
                 Merchant       293
                 Miner         1275
                 Scribe         308
                 Warrior        325
Deep Trench      Fisher        1419
                 Merchant       516
                 Miner          458
                 Scribe         486
                 Warrior       1817
Mariana Plaza    Fisher         314
                 Merchant       306
                 Miner          324
                 Scribe        1259
                 Warrior        915
The Golden Reef  Fisher         478
                 Merchant      2420
                 Miner          971
                 Scribe         468
                 Warrior        474
Name: Occupation, dtype: int64

In [11]:
df.groupby("Occupation")["Wealth_Index"].median()
# to see how occupation is related with the wealth of a person

Occupation
Fisher       4263.595556
Merchant    18780.172007
Miner        7454.654064
Scribe       8400.855990
Warrior      7496.336078
Name: Wealth_Index, dtype: float64

In [12]:
df.groupby("Occupation")["Life_Expectancy"].median()
# to see how long a person from an occupation lives

Occupation
Fisher      43.0
Merchant    65.0
Miner       46.0
Scribe      58.0
Warrior     39.0
Name: Life_Expectancy, dtype: float64

In [ ]:
df["Wealth_Index"].corr(df["Life_Expectancy"])
# correlation between wealth and life expectancy

In [ ]:
df.groupby("Diet_Type")["Wealth_Index"].median()
# to see if rich or poor people eat some specific food